nightt5879/MM32_Template/MM32F0140/STARTUP/Include/reg_rcc.h
#define RCC_APB2ENR_TIM16_Pos           (17)
#define RCC_APB2ENR_TIM16               (0x01U << RCC_APB2ENR_TIM16_Pos)        ///< TIM16 Timer clock enable
#define RCC_APB2ENR_TIM17_Pos           (18)
#define RCC_APB2ENR_TIM17               (0x01U << RCC_APB2ENR_TIM17_Pos)        ///< TIM17 Timer clock enable
#define RCC_APB2ENR_DBGMCU_Pos          (22)
#define RCC_APB2ENR_DBGMCU              (0x01U << RCC_APB2ENR_DBGMCU_Pos)       ///< DBGMCU clock enable
#define RCC_APB2ENR_EXTI_Pos            (29)
#define RCC_APB2ENR_EXTI                (0x01U << RCC_APB2ENR_EXTI_Pos)         ///< EXTI Block enable
#define RCC_APB2ENR_LPTIM1_Pos          (0)

////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_APB1ENR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_APB1ENR_TIM2_Pos            (0)
#define RCC_APB1ENR_TIM2                (0x01U << RCC_APB1ENR_TIM2_Pos)         ///< Timer 2 clock enable

#define RCC_APB1ENR_TIM3_Pos            (1)
#define RCC_APB1ENR_TIM3                (0x01U << RCC_APB1ENR_TIM3_Pos)         ///< Timer 3 clock enabled




#define RCC_APB1ENR_WWDG_Pos            (11)
#define RCC_APB1ENR_WWDG                (0x01U << RCC_APB1ENR_WWDG_Pos)         ///< Window Watchdog clock enable
#define RCC_APB1ENR_MIPI_Pos            (13)
#define RCC_APB1ENR_MIPI                (0x01U << RCC_APB1ENR_MIPI_Pos)         ///< MIPI enable


#define RCC_APB1ENR_SPI2_Pos            (14)
#define RCC_APB1ENR_SPI2                (0x01U << RCC_APB1ENR_SPI2_Pos)         ///< SPI 2 clock enable

#define RCC_APB1ENR_UART2_Pos           (17)
#define RCC_APB1ENR_UART2               (0x01U << RCC_APB1ENR_UART2_Pos)        ///< UART 2 clock enable
#define RCC_APB1ENR_UART3_Pos           (18)
#define RCC_APB1ENR_UART3               (0x01U << RCC_APB1ENR_UART3_Pos)        ///< UART 3 clock enable

#define RCC_APB1ENR_I2C1_Pos            (21)
#define RCC_APB1ENR_I2C1                (0x01U << RCC_APB1ENR_I2C1_Pos)         ///< I2C 1 clock enable

#define RCC_APB1ENR_CAN_Pos             (25)
#define RCC_APB1ENR_CAN                 (0x01U << RCC_APB1ENR_CAN_Pos)          ///< CAN clock enable


#define RCC_APB1ENR_PWR_Pos             (28)
#define RCC_APB1ENR_PWR                 (0x01U << RCC_APB1ENR_PWR_Pos)          ///< Power interface clock enable
#define RCC_APB1ENR_IWDG_Pos            (30)
#define RCC_APB1ENR_IWDG                (0x01U << RCC_APB1ENR_IWDG_Pos)          ///< IWDG interface clock enable

////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_BDCR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_BDCR_BDRST_Pos              (16)
#define RCC_BDCR_BDRST                  (0x01U << RCC_BDCR_BDRST_Pos)           ///< Backup domain software reset
#define RCC_BDCR_DBP_Pos                (24)
#define RCC_BDCR_DBP                    (0x01U << RCC_BDCR_DBP_Pos)             ///< Allow access to RTC and backing registers


////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_CSR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_CSR_LSION_Pos               (0)
#define RCC_CSR_LSION                   (0x01U << RCC_CSR_LSION_Pos)            ///< Internal Low Speed oscillator enable
#define RCC_CSR_LSIRDY_Pos              (1)
#define RCC_CSR_LSIRDY                  (0x01U << RCC_CSR_LSIRDY_Pos)           ///< Internal Low Speed oscillator Ready
#define RCC_CSR_LSI_LV_Pos              (5)
#define RCC_CSR_LSI_LV                  (0x01U << RCC_CSR_LSI_LV_Pos)           ///< The internal 40KHz oscillator is turned on
#define RCC_CSR_PVD_Pos                 (6)
#define RCC_CSR_PVD                     (0x01U << RCC_CSR_PVD_Pos)              ///< PVD reset enable
#define RCC_CSR_LOCK_Pos                (7)
#define RCC_CSR_LOCK                    (0x01U << RCC_CSR_LOCK_Pos)             ///< CPU LOCK reset enable
#define RCC_CSR_VDT_RSTN_Pos            (8)
#define RCC_CSR_VDT_RSTN                (0x01U << RCC_CSR_VDT_RSTN_Pos)         ///< VDT reset enable
#define RCC_CSR_VDTRSTF_Pos             (21)
#define RCC_CSR_VDTRSTF                 (0x01U << RCC_CSR_VDTRSTF_Pos)          ///< VDT reset flag
#define RCC_CSR_PVDRSTF_Pos             (22)
#define RCC_CSR_PVDRSTF                 (0x01U << RCC_CSR_PVDRSTF_Pos)          ///< PVD reset flag
#define RCC_CSR_LOCKUPF_Pos             (23)
#define RCC_CSR_LOCKUPF                 (0x01U << RCC_CSR_LOCKUPF_Pos)          ///< CPU lockup reset flag

#define RCC_CSR_RMVF_Pos                (24)
#define RCC_CSR_RMVF                    (0x01U << RCC_CSR_RMVF_Pos)             ///< Remove reset flag
#define RCC_CSR_PINRSTF_Pos             (26)
#define RCC_CSR_PINRSTF                 (0x01U << RCC_CSR_PINRSTF_Pos)          ///< PIN reset flag

#define RCC_CSR_PORRSTF_Pos             (27)
#define RCC_CSR_PORRSTF                 (0x01U << RCC_CSR_PORRSTF_Pos)          ///< POR/PDR reset flag

#define RCC_CSR_SFTRSTF_Pos             (28)
#define RCC_CSR_SFTRSTF                 (0x01U << RCC_CSR_SFTRSTF_Pos)          ///< Software Reset flag

#define RCC_CSR_IWDGRSTF_Pos            (29)
#define RCC_CSR_IWDGRSTF                (0x01U << RCC_CSR_IWDGRSTF_Pos)         ///< Independent Watchdog reset flag

#define RCC_CSR_WWDGRSTF_Pos            (30)
#define RCC_CSR_WWDGRSTF                (0x01U << RCC_CSR_WWDGRSTF_Pos)         ///< Window watchdog reset flag
#define RCC_CSR_LPWRRSTF_Pos            (31)
#define RCC_CSR_LPWRRSTF                (0x01U << RCC_CSR_LPWRRSTF_Pos)         ///< Low power reset flag

////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_AHBRSTR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_AHBRSTR_DMA1_Pos            (0)
#define RCC_AHBRSTR_DMA1                (0x01U << RCC_AHBRSTR_DMA1_Pos)         ///< DMA clock reset
#define RCC_AHBRSTR_CRC_Pos             (6)
#define RCC_AHBRSTR_CRC                 (0x01U << RCC_AHBRSTR_CRC_Pos)          ///< Internal High Speed clock Calibration
#define RCC_AHBRSTR_GPIOA_Pos           (17)
#define RCC_AHBRSTR_GPIOA               (0x01U << RCC_AHBRSTR_GPIOA_Pos)        ///< GPIOA clock reset
#define RCC_AHBRSTR_GPIOB_Pos           (18)
#define RCC_AHBRSTR_GPIOB               (0x01U << RCC_AHBRSTR_GPIOB_Pos)        ///< GPIOB clock reset
#define RCC_AHBRSTR_GPIOC_Pos           (19)
#define RCC_AHBRSTR_GPIOC               (0x01U << RCC_AHBRSTR_GPIOC_Pos)        ///< GPIOC clock reset
#define RCC_AHBRSTR_GPIOD_Pos           (20)
#define RCC_AHBRSTR_GPIOD               (0x01U << RCC_AHBRSTR_GPIOD_Pos)        ///< GPIOD clock reset
#define RCC_AHBRSTR_HWDIV_Pos           (26)
#define RCC_AHBRSTR_HWDIV               (0x01U << RCC_AHBRSTR_HWDIV_Pos)        ///< HWDIV clock reset

////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_CFGR2 Register Bit Definition
////////////////////////////////////////////////////////////////////////////////

#define RCC_CFGR2_AHB1_HV_Pos           (16)
#define RCC_CFGR2_AHB1_HV               (0x01U << RCC_CFGR2_AHB1_HV_Pos)        ///< APB1_HV output clock 2 frequency division
#define RCC_CFGR2_MCO_PRE_Pos           (20)
#define RCC_CFGR2_MCO_PRE_1             (0x00U << RCC_CFGR2_MCO_PRE_Pos)        ///< MCO 1 frequency division
#define RCC_CFGR2_MCO_PRE_2             (0x08U << RCC_CFGR2_LPTIMSEL_Pos)       ///< MCO 2 frequency division
#define RCC_CFGR2_MCO_PRE_4             (0x09U << RCC_CFGR2_LPTIMSEL_Pos)       ///< MCO 4   frequency division
#define RCC_CFGR2_MCO_PRE_8             (0x0AU << RCC_CFGR2_MCO_PRE_Pos)        ///< MCO 8   frequency division
#define RCC_CFGR2_MCO_PRE_16            (0x0BU << RCC_CFGR2_LPTIMSEL_Pos)       ///< MCO 16  frequency division
#define RCC_CFGR2_MCO_PRE_64            (0x0CU << RCC_CFGR2_LPTIMSEL_Pos)       ///< MCO 64  frequency division
#define RCC_CFGR2_MCO_PRE_128           (0x0DU << RCC_CFGR2_LPTIMSEL_Pos)       ///< MCO 128 frequency division
#define RCC_CFGR2_MCO_PRE_256           (0x0EU << RCC_CFGR2_LPTIMSEL_Pos)       ///< MCO 256 frequency division
#define RCC_CFGR2_MCO_PRE_512           (0x0FU << RCC_CFGR2_LPTIMSEL_Pos)       ///< MCO 512 frequency division

////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_SYSCFG Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_SYSCFG_PROGCHECKEN_Pos      (0)
#define RCC_SYSCFG_PROGCHECKEN          (0x01U << RCC_SYSCFG_PROGCHECKEN_Pos)   ///< Whether to check the number in Flash when writing to Flash
#define RCC_SYSCFG_PAGESIZE_Pos         (1)
#define RCC_SYSCFG_PAGESIZE             (0x01U << RCC_SYSCFG_PAGESIZE_Pos)      ///< Flash Page size
#define RCC_SYSCFG_OSC_RTRIM_Pos        (8)
#define RCC_SYSCFG_OSC_RTRIM            (0x03U << RCC_SYSCFG_OSC_RTRIM_Pos)     ///< Oscillator feedback resistance trimming
#define RCC_SYSCFG_OSC_LPFEN_Pos        (14)
#define RCC_SYSCFG_OSC_LPFEN            (0x01U << RCC_SYSCFG_OSC_LPFEN_Pos)     ///< Oscillator low pass filtering enable
#define RCC_CONFIG_PAGESIZE_Pos         RCC_SYSCFG_PAGESIZE_Pos
#define RCC_CONFIG_PAGESIZE             RCC_SYSCFG_PAGESIZE
#define RCC_CONFIG_OSC_RTRIM_Pos        RCC_SYSCFG_OSC_RTRIM_Pos
#define RCC_CONFIG_OSC_RTRIM            RCC_SYSCFG_OSC_RTRIM
#define RCC_CONFIG_OSC_LPFEN_Pos        RCC_SYSCFG_OSC_LPFEN_Pos
#define RCC_CONFIG_OSC_LPFEN            RCC_SYSCFG_OSC_LPFEN
////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_HSIDLY Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_HSIDLY_Pos                  (0)
#define RCC_HSIDLY                      (0xFFU << RCC_HSIDLY_Pos)               ///< HSI delay count value 
////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_HSEDLY Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_HSEDLY_Pos                  (0)
#define RCC_HSEDLY                      (0xFFFFU << RCC_HSEDLY_Pos)             ///< HSE delay count value 
////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_ICSCR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_ICSCR_HSICALSEL_Pos         (11)
#define RCC_ICSCR_HSICALSEL             (0x1FU << RCC_ICSCR_HSICALSEL_Pos)      ///< Select the value of register HSICAL 
#define RCC_ICSCR_HSICALSFT_Pos         (16)
#define RCC_ICSCR_HSICALSFT             (0x1FU << RCC_ICSCR_HSICALSFT_Pos)      ///< Select the value of register HSICAL 

////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_PLLCFGR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_PLLCFGR_PLLSRC_Pos          (0)
#define RCC_PLLCFGR_PLLSRC              (0x01U << RCC_PLLCFGR_PLLSRC_Pos)       ///< HSE as PLL entry clock
#define RCC_PLLCFGR_PLLXTPRE_Pos        (1)
#define RCC_PLLCFGR_PLLXTPRE            (0x01U << RCC_PLLCFGR_PLLXTPRE_Pos)     ///< HSE frequency division for PLL entry
#define RCC_PLLCFGR_PLL_ICTRL_Pos       (2)
#define RCC_PLLCFGR_PLL_ICTRL           (0x03U << RCC_PLLCFGR_PLL_ICTRL_Pos)    ///< PLL CP current control signals mask
#define RCC_PLLCFGR_PLL_ICTRL_0         (0x00U << RCC_PLLCFGR_PLL_ICTRL_Pos)    ///< PLL CP current control signals 2.5u
#define RCC_PLLCFGR_PLL_ICTRL_1         (0x01U << RCC_PLLCFGR_PLL_ICTRL_Pos)    ///< PLL CP current control signals 5u
#define RCC_PLLCFGR_PLL_ICTRL_2         (0x02U << RCC_PLLCFGR_PLL_ICTRL_Pos)    ///< PLL CP current control signals 7.5u
#define RCC_PLLCFGR_PLL_ICTRL_3         (0x03U << RCC_PLLCFGR_PLL_ICTRL_Pos)    ///< PLL CP current control signals 10u
#define RCC_PLLCFGR_PLL_ICTRL_2_5       (0x00U << RCC_PLLCFGR_PLL_ICTRL_Pos)    ///< PLL CP current control signals 2.5u
#define RCC_PLLCFGR_PLL_ICTRL_5         (0x01U << RCC_PLLCFGR_PLL_ICTRL_Pos)    ///< PLL CP current control signals 5u
#define RCC_PLLCFGR_PLL_ICTRL_7_5       (0x02U << RCC_PLLCFGR_PLL_ICTRL_Pos)    ///< PLL CP current control signals 7.5u
#define RCC_PLLCFGR_PLL_ICTRL_10        (0x03U << RCC_PLLCFGR_PLL_ICTRL_Pos)    ///< PLL CP current control signals 10u
#define RCC_PLLCFGR_PLL_LDS_Pos         (4)
#define RCC_PLLCFGR_PLL_LDS             (0x03U << RCC_PLLCFGR_PLL_LDS_Pos)      ///< PLL LOCK DETECTOR ACCURACY SELECT
#define RCC_PLLCFGR_PLL_LDS_0           (0x00U << RCC_PLLCFGR_PLL_LDS_Pos)      ///< PLL LOCK DETECTOR ACCURACY value = 0
#define RCC_PLLCFGR_PLL_LDS_1           (0x01U << RCC_PLLCFGR_PLL_LDS_Pos)      ///< PLL LOCK DETECTOR ACCURACY value = 1
#define RCC_PLLCFGR_PLL_LDS_2           (0x02U << RCC_PLLCFGR_PLL_LDS_Pos)      ///< PLL LOCK DETECTOR ACCURACY value = 2
#define RCC_PLLCFGR_PLL_LDS_3           (0x03U << RCC_PLLCFGR_PLL_LDS_Pos)      ///< PLL LOCK DETECTOR ACCURACY value = 3
#define RCC_PLLCFGR_PLL_DP_Pos          (8)
#define RCC_PLLCFGR_PLL_DP              (0x07U << RCC_PLLCFGR_PLL_DP_Pos)       ///< PLL DP
#define RCC_PLLCFGR_PLL_DN_Pos          (16)
#define RCC_PLLCFGR_PLL_DN              (0xFFU << RCC_PLLCFGR_PLL_DN_Pos)       ///< PLL DN
#define RCC_PLLCFGR_PLL_DM_Pos          (29)
#define RCC_PLLCFGR_PLL_DM              (0x07U << RCC_PLLCFGR_PLL_DM_Pos)       ///< PLL DM
////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_PLLDLY Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_PLLDLY_EQU_CNT_Pos          (0)
#define RCC_PLLDLY_EQU_CNT              (0x03FFU << RCC_PLLDLY_EQU_CNT_Pos)       ///< PLL delay time

/// @}

/// @}

/// @}

////////////////////////////////////////////////////////////////////////////////
#endif
////////////////////////////////////////////////////////////////////////////////
